{
  "ARTICLE 2 — OBLIGATIONS": "Article 2 outlines the obligations of both Parties during the Transition Period. Each Party is required to act in good faith and comply with relevant laws while fulfilling their ongoing responsibilities. AirAsia must facilitate the transfer of specified assets and operational controls to Vistara, which will only assume control after meeting regulatory requirements. The Article details the structured transition of employees, specifying eligibility criteria and compensation arrangements, as well as the need for compliance with Vistara's policies. Additionally, it establishes audit rights for Vistara and outlines consequences for non-performance, including the potential suspension of integration activities or termination of the Agreement.",
  "ARTICLE 3 — CONFIDENTIALITY, PUBLIC": "Article 3 outlines the obligations related to confidentiality, public communications, ethical conduct, and insider trading in the context of a merger and its subsequent operations. It defines \"Confidential Information\" and specifies exclusions, emphasizing that such information must only be used for the purposes of the agreement and not for personal gain. Access to this information is restricted on a need-to-know basis, and a structured framework for public communications is established, categorizing permissible, restricted, and prohibited actions. The article also addresses the handling of Material Non-Public Information (MNPI) and imposes insider trading restrictions during and after employment. Breaches of these obligations may lead to significant consequences, including termination and legal action, with confidentiality obligations surviving for five years post-termination.",
  "ARTICLE 4 — INTELLECTUAL PROPERTY": "Article 4 addresses the management of intellectual property (IP) related to the merger and subsequent operations. It establishes that each party retains ownership of their pre-existing IP while granting Vistara a non-exclusive, royalty-free license to use AirAsia's IP for specific operational purposes. Any IP created during the integration process will belong to Vistara, and AirAsia's branding will have limited use post-merger. The article also outlines the handling of operational data and imposes restrictions on AirAsia regarding the use of Vistara's IP. Additionally, it mandates that both parties notify each other of any suspected IP infringement, with Vistara holding the primary enforcement rights. The provisions of this article will remain in effect even after the agreement's termination.",
  "ARTICLE 5 — LIABILITY": "Article 5 outlines the allocation of liabilities and responsibilities between the Parties concerning pre-merger, transition, and post-merger activities. AirAsia retains responsibility for all liabilities incurred before the Effective Date, including employee claims and regulatory penalties. Vistara will not assume any liabilities related to vendors providing catering and food services, but will take on airport-related fees and charges associated with AirAsia operations. Employee claims will be managed based on the timing of their transition, with Vistara assuming responsibility for claims arising after the transition date. The Article also includes indemnification provisions for both Parties and establishes a claims process, with a limitation on liability for indirect damages, and specifies that these provisions will survive for seven years post-termination of the Agreement.",
  "ARTICLE 6 — GOVERNANCE": "Article 6 outlines the governance structure for the merged operations, detailing the composition of the Board of Directors, decision-making authority, and oversight mechanisms. The Board will consist of ten directors, with seven appointed by the Parent Company and three by AirAsia, and the Chairperson will be nominated by the Parent Company, holding a casting vote in case of ties. Directors will serve a two-year term, with specific matters requiring the affirmative approval of Parent Company nominees. The Article also establishes the formation of Board Committees, mandates the disclosure of conflicts of interest, and emphasizes compliance with relevant laws and regulations. Breaches of this Article are considered material, allowing for remedies, and governance provisions will survive termination to ensure the enforcement of decisions made during the Agreement's term.",
  "ARTICLE 7 — MILESTONES & PAYMENTS": "Article 7 outlines the milestone-driven payment structure between Vistara and AirAsia related to the phased transfer of routes, assets, and employee integration. Payments are contingent upon the successful completion of specified integration phases, which are divided into three circuits, and are released in five tranches based on the achievement of defined milestones. The completion of each phase must be certified by the Joint Integration Committee, and employee transitions must follow a specified order. Delays caused by either party may affect the timing of payments, but do not automatically accelerate payment obligations. Additionally, Vistara retains the right to audit relevant records, and all payments are subject to applicable tax withholdings.",
  "ARTICLE 8 — EXIT, TERMINATION & CONSEQUENCES": "Article 8 outlines the terms regarding the exit, termination, and consequences of the Agreement. It establishes that the Agreement commences on the Effective Date and continues until all integration activities and payments are completed, unless terminated for material breach or by Vistara or AirAsia under specified conditions. Vistara may exit the transaction, resulting in the cessation of employee transitions and forfeiture of unpaid payment tranches, while AirAsia can exit only due to a material breach by Vistara, leading to forfeiture of unpaid tranches and board representation rights. The Article also clarifies that transferred assets and routes do not revert upon termination, and payments made prior to termination are non-refundable, except in cases of fraud or willful misconduct. Confidentiality and intellectual property obligations will survive termination, and the Parties are required to cooperate with regulators for an orderly transition or unwinding of operations.",
  "ARTICLE 9 — AMENDMENTS, EVOLUTION & CHANGE": "Article 9 outlines the evolution and amendment process of the Agreement, serving as a reference for interpretation and analysis. It details the incremental introduction of amendments aimed at clarifying scope, reallocating risk, and codifying operational decisions across three drafting rounds. Each round established specific principles and obligations, impacting various articles related to employee policies, confidentiality, operational structuring, and governance. The Article emphasizes that amendments do not imply waivers of rights and mandates that future changes must be documented in writing and approved according to governance provisions. Additionally, it clarifies that this Article will remain effective even after the Agreement's termination."
}