{
  "ARTICLE 2 — OBLIGATIONS": "2.1 General Obligations. Each Party shall perform its obligations under this Agreement in good faith, exercising reasonable best efforts and acting in compliance with all applicable aviation, corporate, labor, and competition laws. The obligations contained herein are continuing in nature and shall apply throughout the Transition Period. 2.2 Asset and Route Transfer Obligations. AirAsia shall identify, document, and make available for transfer all aircraft, routes, landing slots, parking rights, and operational permissions approved for transition. Vistara shall assume operational control only upon certification of regulatory readiness and completion of applicable circuit milestones. 2.3 Transitional Cooperation. The Parties shall cooperate fully to ensure uninterrupted operations, including transfer of manuals, maintenance logs, crew rosters, training records, and safety documentation. No Party shall unreasonably withhold information required for integration. 2.4 Employee Transition Framework. Employee transition shall occur strictly in the following order: (a) Pilots; (b) Cabin Crew; (c) Technical Staff; (d) Ground Staff. Deviation from this sequence shall require prior written approval of both Parties and the Joint Integration Committee. 2.5 Eligible Employees. Only permanent employees on AirAsia’s payroll as of the Effective Date shall be eligible for transition. Temporary, contractual, outsourced, probationary, or trainee personnel are expressly excluded and shall have no rights under this Agreement. 2.6 Work Hours and Rosters. Pilots and Cabin Crew shall comply with Vistara’s duty rosters, flight duty time limitations, and scheduling policies upon transition. Ground Staff shall continue to follow AirAsia’s work-hour structures unless otherwise agreed in writing. 2.7 Compensation — Pilots. Pilots with more than five thousand (5,000) flying hours shall continue to receive compensation equivalent to their existing AirAsia cost-to-company. Pilots with fewer than 5,000 hours shall be transitioned to Vistara’s salary framework, subject to an upper compensation ceiling. 2.8 Compensation — Cabin Crew. Cabin Crew shall adopt Vistara’s salary structure applicable to comparable roles. Notwithstanding the foregoing, Vistara-specific HR benefits, including annual leave and yearly off programs, shall not apply unless expressly approved. 2.9 Equity Compensation Restriction. AirAsia employees shall not be eligible for stock options, restricted stock units, or equity-linked incentives for a period of three (3) years from the Effective Date. 2.10 Ethics and Compliance. All transitioning employees shall comply with Vistara’s Code of Conduct, anti-bribery and anti-corruption policies, aviation safety requirements, and data protection laws. Any violation shall constitute material breach. 2.11 Training and Certification. Vistara shall provide required induction, safety, and operational training to transitioning employees. Employees shall maintain all certifications required by law. 2.12 Regulatory Cooperation. Each Party shall cooperate with DGCA, airport authorities, and other regulators, including responding to inquiries and facilitating inspections. 2.13 Audit and Inspection Rights. Vistara shall have the right to audit records relating to employee eligibility, compensation, and compliance. AirAsia shall provide reasonable access for verification.  2.14 Consequences of Non-Performance. Failure to perform obligations under this Article shall entitle the non-defaulting Party to suspend integration activities, withhold milestone payments, or terminate this Agreement in accordance with Article 8.",
  "ARTICLE 3 — CONFIDENTIALITY, PUBLIC": "COMMUNICATION & INSIDER TRADING 3.1 Purpose and Applicability. This Article establishes comprehensive obligations relating to confidentiality, public communications, ethical conduct, and prevention of insider trading in connection with the merger, integration activities, and post-merger operations. These obligations apply to all transitioning employees, continuing employees with access to confidential information, directors, officers, consultants, and advisors. 3.2 Confidential Information Defined. Confidential Information includes all non-public information relating to this Agreement, integration plans, milestones, payments, employee data, vendor arrangements, airport dues, route strategies, board deliberations, voting outcomes, financial projections, and strategic intent, whether oral, written, electronic, or otherwise. 3.3 Exclusions. Confidential Information does not include information that is publicly available without breach, independently developed without reference to Confidential Information, or disclosed pursuant to legal or regulatory requirements. 3.4 Permitted Use. Confidential Information shall be used solely for purposes of implementing and complying with this Agreement and shall not be used for personal gain or competitive advantage. 3.5 Access Controls. Access to Confidential Information shall be restricted on a strict need-to-know basis. Each Party shall implement administrative, technical, and physical safeguards to protect such information. 3.6 Public Communications Framework. Employees may engage in limited public communications subject to the hierarchy set forth herein. 3.6.1 Tier-1 (Permitted). Employees may update professional profiles (e.g., LinkedIn) to reflect employment status or share official press releases without commentary, provided no strategic or non-public information is disclosed. 3.6.2 Tier-2 (Restricted). Prior written approval from Corporate Communications and Legal is required for any discussion of timelines, compensation alignment, workforce changes, conference participation, or responses to media or analyst inquiries. 3.6.3 Tier-3 (Prohibited). Employees shall not publish insider narratives, disclose board deliberations, speculate on routes, layoffs, payments, or represent themselves as spokespersons. Such conduct constitutes gross misconduct. 3.7 Media and Analyst Interaction. Only authorized spokespersons may engage with media or analysts. Any unsolicited inquiries must be escalated immediately. 3.8 Ethical Conduct. All covered persons shall comply with applicable ethics standards, anti-bribery and anti-corruption laws, competition laws, and aviation safety requirements. 3.9 Insider Trading and MNPI. Material Non-Public Information includes merger valuation, payment tranches, governance changes, and financial performance. No person in possession of MNPI may trade securities, recommend trading, or disclose MNPI. 3.10 Restricted Period. Insider trading restrictions apply during employment and for twelve (12) months following cessation of employment or board tenure.  3.11 Monitoring and Enforcement. Vistara may monitor compliance subject to law. Breach constitutes material breach and may result in termination, injunctive relief, and damages. 3.12 Survival. Confidentiality and insider trading obligations survive termination for five (5) years, or longer where required by law.",
  "ARTICLE 4 — INTELLECTUAL PROPERTY": "4.1 Purpose and Scope. This Article governs the ownership, licensing, use, protection, and enforcement of intellectual property in connection with the merger, integration activities, and post-merger operations. 4.2 Pre-Existing Intellectual Property. Each Party retains all right, title, and interest in its respective pre-existing intellectual property, including trademarks, trade names, logos, software, manuals, databases, processes, and proprietary know-how. 4.3 License to Vistara. AirAsia hereby grants Vistara a non-exclusive, royalty-free, perpetual, and irrevocable license to use AirAsia intellectual property solely for operating transferred aircraft, routes, and services. 4.4 Operational IP. AirAsia shall provide access to operational manuals, maintenance records, training material, and safety documentation necessary for compliant airline operations. 4.5 Derivative Works. Any enhancements, adaptations, or derivative works created during integration shall vest exclusively in Vistara, without prejudice to AirAsia’s retained ownership of underlying IP. 4.6 Integration-Created IP. All intellectual property created, authored, or developed during the Transition Period shall vest solely in Vistara, including workflows, software configurations, training programs, and data models. 4.7 Branding and Trademarks. AirAsia branding shall not be used for external purposes post-merger except under a limited transitional branding arrangement approved in writing. 4.8 Data and Records. Operational data, employee records, and customer data transferred shall be used solely for lawful business purposes and protected in accordance with applicable data protection laws. 4.9 Restrictions. AirAsia shall not reverse engineer, replicate, sublicense, or disclose Vistara intellectual property to third parties without written consent. 4.10 Infringement and Enforcement. Each Party shall notify the other of suspected infringement. Vistara shall have the primary right to enforce IP relating to post-merger operations. 4.11 Survival. Licenses and restrictions under this Article shall survive termination of this Agreement.",
  "ARTICLE 5 — LIABILITY": "5.1 Purpose and Allocation Framework. This Article sets forth the allocation of liabilities, responsibilities, and risk between the Parties in relation to pre-merger activities, transition activities, and post-merger operations. No liability shall be assumed by implication. 5.2 Pre-Effective Date Liabilities. All liabilities, obligations, debts, penalties, claims, and costs arising prior to the Effective Date shall remain the sole responsibility of AirAsia, including employee claims, tax dues, regulatory penalties, and litigation. 5.3 Vendor Liabilities — Catering and Food Services. Vendors providing food, catering, and in-flight services to AirAsia shall not be continued post-merger. Vistara shall not assume any liability for outstanding payments, termination charges, or claims relating to such vendors. 5.4 Airport Charges and Overdues. Notwithstanding Section 5.3, all airport-related fees, charges, penalties, and overdues attributable to AirAsia operations shall be carried forward and assumed by Vistara, subject to reconciliation and verification. 5.5 Employee-Related Liabilities. Employee claims arising prior to an individual employee’s transition date shall remain with AirAsia. Claims arising after transition shall be borne by Vistara, subject to compliance with applicable law. 5.6 Excluded Workforce. Vistara shall bear no liability for claims arising from non-selection or non-transition of ground staff engaged solely in boarding and check-in operations, or temporary, contractual, outsourced, or agency personnel. 5.7 Operational and Aviation Liability. From the applicable circuit completion date, Vistara shall assume liability for flight operations, safety compliance, passenger obligations, and regulatory adherence for transferred routes. 5.8 Indemnification by AirAsia. AirAsia shall indemnify and hold harmless Vistara against all losses arising from pre-Effective Date liabilities, excluded vendor claims, and misrepresentation. 5.9 Indemnification by Vistara. Vistara shall indemnify AirAsia against losses arising from post-transition operational liabilities and assumed obligations. 5.10 Limitation of Liability. Neither Party shall be liable for indirect or consequential damages except in cases of fraud, willful misconduct, breach of confidentiality, or insider trading. 5.11 Claims Process. The indemnified Party shall promptly notify the indemnifying Party of any claim. Failure to notify shall not relieve indemnity obligations unless material prejudice occurs. 5.12 Survival. The provisions of this Article shall survive termination of this Agreement for a period of seven (7) years or longer as required by law.",
  "ARTICLE 6 — GOVERNANCE": "6.1 Governance Framework. This Article establishes the governance structure, Board composition, decision-making authority, and oversight mechanisms applicable to the merged operations. Governance provisions reflect economic ownership, risk assumption, and strategic control. 6.2 Board Composition. With effect from the Effective Date, the Board of Directors shall be reconstituted to comprise ten (10) directors, with seven (7) nominated by the Parent Company and three (3) nominated by AirAsia. 6.3 Chairperson and Casting Vote. The Chairperson shall be nominated by the Parent Company and shall have a casting vote in the event of a tie, except where prohibited by law. 6.4 Tenure of Directors. The tenure of all directors appointed pursuant to this Agreement shall be two (2) years, renewable subject to re-appointment. Any prior reference to a three-year tenure shall stand amended. 6.5 Voting and Quorum. Each director shall have one vote. Quorum shall require the presence of at least one Parent Company nominee. Decisions shall be taken by simple majority unless otherwise specified. 6.6 Reserved Matters. The following matters shall require affirmative approval of Parent Company nominees: approval of budgets, appointment or removal of key management, changes to route or fleet strategy, material contracts, mergers or divestments, issuance of equity, and changes to compensation frameworks. 6.7 Board Committees. The Board may constitute Audit, Risk, Nomination and Remuneration, and Safety Committees. Each committee shall be chaired by a Parent Company nominee unless required otherwise by law. 6.8 Conflict of Interest. Directors shall disclose actual or potential conflicts promptly. A conflicted director shall abstain from deliberation and voting on the relevant matter. 6.9 Duties and Standards. Directors shall act in good faith, in the best interests of the company, and with due care, skill, and diligence, complying with applicable corporate governance laws. 6.10 Regulatory Compliance. The Board shall ensure compliance with Companies Act, SEBI regulations, DGCA oversight requirements, and aviation safety obligations. 6.11 Breach and Remedies. Breach of this Article constitutes material breach, entitling the non-defaulting Party to exercise remedies under this Agreement. 6.12 Survival. Governance provisions shall survive termination to the extent necessary to give effect to decisions taken during the term of this Agreement.",
  "ARTICLE 7 — MILESTONES & PAYMENTS": "7.1 Purpose and Commercial Structure. This Article sets forth the milestone-driven commercial framework governing payments by Vistara to AirAsia in consideration of the phased transfer of routes, assets, and employee integration. Payments are conditional, performance-linked, and non-accelerative. 7.2 Route Integration Phases. Route integration shall be executed in the following sequential phases: (a) Circuit 1 – Mumbai, Delhi, Chennai, Kolkata, Bangalore; (b) Circuit 2 – routes operating more than one hundred (100) flights per day; and (c) Circuit 3 – all remaining routes. 7.3 Certification of Completion. Completion of each Circuit shall be certified in writing by the Joint Integration Committee upon confirmation of operational readiness, regulatory compliance, and service continuity. 7.4 Employee Transition Milestones. Employee transitions shall occur in the mandatory order of Pilots, Cabin Crew, Technical Staff, and Ground Staff (to the extent applicable). Excluded personnel shall not be counted for milestone completion. 7.5 Payment Tranches. The total consideration shall be released in five (5) tranches as follows: Tranche 1 upon signing and initial regulatory acknowledgment; Tranche 2 upon Circuit 1 completion; Tranche 3 upon Circuit 2 completion; Tranche 4 upon completion of Pilot, Crew, and Technical Staff transition; and Tranche 5 upon final regulatory clearance and Circuit 3 completion. 7.6 Conditions Precedent. Payment of each tranche is subject to absence of material breach, accuracy of representations, regulatory clearance, and compliance with confidentiality and governance obligations. 7.7 Delays and Deferrals. Delays attributable to AirAsia shall result in deferral of the applicable tranche without interest. Delays attributable to Vistara shall not trigger automatic acceleration but may require good-faith renegotiation. 7.8 Audit and Verification Rights. Vistara shall have the right to audit records and processes relevant to milestone completion. AirAsia shall provide reasonable access for verification purposes. 7.9 No Waiver or Acceleration. Failure to enforce a milestone shall not constitute waiver. No tranche shall be accelerated except pursuant to written amendment. 7.10 Taxes and Withholding. All payments shall be subject to applicable tax withholding. Each Party shall bear its own tax liabilities unless required otherwise by law. 7.11 Survival. Payment, audit, and verification obligations shall survive termination to the extent necessary to settle accrued amounts.",
  "ARTICLE 8 — EXIT, TERMINATION & CONSEQUENCES": "8.1 Term. This Agreement shall commence on the Effective Date and continue until completion of all integration activities and payment of all tranches, unless earlier terminated in accordance with this Article. 8.2 Termination for Material Breach. Either Party may terminate this Agreement upon material breach by the other Party that remains uncured for thirty (30) days following written notice. 8.3 Exit by Vistara. Vistara may elect to exit the transaction prior to completion of milestones. Upon such exit, all further employee transitions shall cease, no additional payment tranches shall be payable, and unpaid tranches shall stand forfeited. 8.4 Consequences of Vistara Exit. Employees already transitioned shall remain employees of Vistara. Intellectual property licenses shall terminate except for regulatory and operational continuity. Governance arrangements shall lapse prospectively. 8.5 Exit by AirAsia. AirAsia may exit only upon material breach by Vistara that remains uncured. Upon such exit, unpaid tranches and board representation rights shall be forfeited. 8.6 Effect on Assets and Routes. Assets and routes already transferred shall not revert upon termination unless required by law. 8.7 Effect on Employees. Termination shall not retroactively affect salaries paid or service periods accrued. No obligation to transition additional employees shall survive termination. 8.8 Effect on Payments. Payments made prior to termination shall be non-refundable except in cases of fraud or willful misconduct. 8.9 Confidentiality and IP. Confidentiality and intellectual property obligations shall survive termination in accordance with Articles 3 and 4. 8.10 Regulatory Cooperation. The Parties shall cooperate with regulators to ensure orderly continuation or unwinding of operations. 8.11 Remedies Cumulative. Termination rights are cumulative and not exclusive of other remedies. 8.12 Survival. Articles intended by their nature to survive termination shall remain in effect.",
  "ARTICLE 9 — AMENDMENTS, EVOLUTION & CHANGE": "SUMMARY 9.1 Purpose. This Article documents the evolution of this Agreement across multiple drafting rounds and serves as an authoritative reference for interpretation, audit, and automated analysis. 9.2 Amendment Methodology. Amendments were introduced incrementally to clarify scope, reallocate risk, and codify operational and governance decisions. 9.3 Round 1 (Version 1). Round 1 established baseline principles relating to asset transfer, employee policy alignment, confidentiality, and indicative governance intent. 9.4 Impact on Article 2. Initial obligations required all transitioning employees to follow Vistara policies and work hours without role-based differentiation. 9.5 Impact on Article 3. Confidentiality obligations were defined at a high level without a public communication hierarchy. 9.6 Round 2 (Version 2). Round 2 introduced operational structuring, including role-based work hours, mandatory employee transition sequencing, and phased route integration. 9.7 Impact on Article 2 (V2). Work-hour compliance was restricted to Pilots and Cabin Crew, with Ground Staff excluded. Transition sequencing was fixed. 9.8 Impact on Article 7 (V2). Circuit-based route transition was introduced, creating conditionality for milestone completion. 9.9 Round 3 (Version 3). Round 3 focused on economic, liability, and governance refinement. 9.10 Impact on Article 2 (V3). Salary conversion logic for Pilots and Cabin Crew was introduced along with equity compensation restrictions. 9.11 Impact on Article 5 (V3). Vendor liability carve-outs and selective airport dues assumption were introduced. 9.12 Impact on Article 6 (V3). Board restructuring, voting control, tenure reduction, and conflict of interest enforcement were codified. 9.13 No Implied Waiver. Amendments shall not be construed as waivers of rights not expressly stated. 9.14 Future Amendments. Any future amendments must be in writing, reference affected clauses, and be approved in accordance with governance provisions. 9.15 Interpretive Guidance. This Article supports interpretive clarity but does not override operative provisions. 9.16 Survival. This Article shall survive termination of the Agreement."
}